Repository: talnetd/MESCController
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: my

source: Check Bill Status
my: မီတာခဆောင်ထားမှု စစ်ဆေးရန်

source: Congrats! You already have paid Meter Bill for {}.
my: ဝမ်းမြောက်ပါတယ်။ ရည်ညွှန်းအမှတ် {} အတွက် မီတာခ ဆောင်ပြီးဖြစ်နေပါပြီ။

source: Sorry. We could not find Meter Bill for {}.
my: ဝမ်းနည်းပါတယ်။ ရည်ညွှန်းအမှတ် {} အတွက် မီတာခ အချက်အလက် မတွေ့ပါ။

source: Reference Code
my: ရည်ညွှန်းကုဒ်နံပါတ်

source: Enter reference code to check Bill Status.
my: မီတာဆောင်ထားမှု ရှိ/မရှိ စစ်ဆေးရန် ရည်ညွှန်းအမှတ်ကို ရိုက်ပါ။

source: Ks {} ({} units and over)
my: {} ကျပ် ({} ယူနစ်မှ အထက်)

source: Ks {} (from {} unit(s) to {} units)
my: {} ကျပ် ({} ယူနစ်မှ {} ယူနစ်အထိ)

source: Name (En)
my: အမည် (အင်္ဂလိပ်)

source: Name (My)
my: အမည် (မြန်မာ)

source: List Regions/States
my: တိုင်း/ပြည်နယ်များ စာရင်း

source: Add Region/State
my: တိုင်း/ပြည်နယ် အသစ်ထည့်ရန်

source: Edit Region/State
my: တိုင်း/ပြည်နယ် ပြင်ဆင်ရန်

source: Region/State Info
my: တိုင်း/ပြည်နယ် အချက်အလက်

source: Region/State
my: တိုင်း/ပြည်နယ်

source: List Townships
my: မြို့နယ်များ စာရင်း

source: Add Township
my: မြို့နယ် အသစ်ထည့်ရန်

source: Edit Township
my: မြို့နယ် ပြင်ဆင်ရန်

source: Township Info
my: မြို့နယ် အချက်အလက်

source: List Titles
my: ဂုဏ်ပုဒ် စာရင်း

source: Add Title
my: ဂုဏ်ပုဒ် အသစ်ထည့်ရန်

source: Edit Title
my: ဂုဏ်ပုဒ် ပြင်ဆင်ရန်

source: Title Info
my: ဂုဏ်ပုဒ် အချက်အလက်

source: Title
my: ဂုဏ်ပုဒ်

source: N.R.C
my: မှတ်ပုံတင်နံပါတ်

source: Address
my: လိပ်စာ

source: Region
my: တိုင်း

source: Township
my: မြို့နယ်

source: Phones
my: ဖုန်းနံပါတ်များ

source: Naming
my: အမည်ဆိုင်ရာ

source: Additional
my: အခြားအချက်အလက်

source: Contact
my: ဆက်သွယ်ရန်

source: List Customers
my: သုံးစွဲသူများ စာရင်း

source: Add Customer
my: သုံးစွဲသူ အသစ်ထည့်ရန်

source: Edit Customer
my: သုံးစွဲသူ ပြင်ဆင်ရန်

source: Customer Info
my: သုံးစွဲသူဆိုင်ရာ အချက်အလက်

source: Box Number
my: မီတာပုံးအမှတ်

source: List Meterboxes
my: မီတာပုံး စာရင်း

source: Add Meterbox
my: မီတာပုံး အသစ်ထည့်ရန်

source: Edit Meterbox
my: မီတာပုံး ပြင်ဆင်ရန်

source: Meterbox Info
my: မီတာပုံး အချက်အလက်

source: Account No.
my: ငွေစာရင်းအမှတ်

source: Reading Date
my: မီတာဖတ်သည့်နေ့

source: Due Date
my: နောက်ဆုံးပေးဆောင်ရက်

source: Previous Reading
my: အရင်လ ဖတ်ခြင်း

source: Current Reading
my: ယခု ဖတ်ခြင်း

source: Reading Difference
my: မီတာဖတ်ခြင်း ကွာခြားမှု

source: Subtotal
my: စုစုပေါင်း

source: Maintenance Fee
my: မီတာထိန်းသိမ်းခ

source: Horsepower Fee
my: မြင်းကောင်ရေခ

source: Grand Total
my: ပေးသွင်းရန် စုစုပေါင်း

source: Remark
my: မှတ်ချက်

source: Meterbox Number
my: မီတာပုံးအမှတ်

source: List Bills
my: ရှင်းတမ်း စာရင်း

source: Add Bill
my: ရှင်းတမ်း အသစ်ထည့်ရန်

source: Edit Bill
my: ရှင်းတမ်း ပြင်ဆင်ရန်

source: Bill Info
my: ရှင်းတမ်း အချက်အလက်

source: Bill
my: ရှင်းတမ်း

source: Unit Price
my: ယူနစ်ဈေး

source: Quantity
my: အရေအတွက်

source: Line Total
my: စုစုပေါင်း

source: List Bill Details
my: ရှင်းတမ်း အသေးစိတ် စာရင်း

source: Add Bill Detail
my: ရှင်းတမ်း အသေးစိတ် ထည့်ရန်

source: Edit Bill Detail
my: ရှင်းတမ်း အသေးစိတ် ပြင်ဆင်ရန်

source: Bill Detail Info
my: ရှင်းတမ်း အသေးစိတ် အချက်အလက်

source: Provider Code
my: ငွေကြေးဝန်ဆောင်မှုပေးသူ၏ ကုဒ်

source: Name
my: အမည်

source: List Providers
my: ငွေကြေးဝန်ဆောင်မှုပေးသူများ စာရင်း

source: Add Provider
my: ငွေကြေးဝန်ဆောင်မှုပေးသူ အသစ်ထည့်ရန်

source: Edit Provider
my: ငွေကြေးဝန်ဆောင်မှုပေးသူ ပြင်ဆင်ရန်

source: Provider Info
my: ငွေကြေးဝန်ဆောင်မှုပေးသူ အချက်အလက်

source: List Retailers
my: ကိုယ်စားလှယ်များ စာရင်း

source: Add Retailer
my: ကိုယ်စားလှယ် အသစ်ထည့်ရန်

source: Edit Retailer
my: ကိုယ်စားလှယ် ပြင်ဆင်ရန်

source: Retailer Info
my: ကိုယ်စားလှယ် အချက်အလက်

source: Agent Type
my: အေးဂျင့်အမျိုးအစား

source: Agent
my: အေးဂျင့်

source: Regions/States
my: တိုင်းဒေသကြီး/ပြည်နယ်များ

source: Manage
my: စီမံရန်

source: Townships
my: မြို့နယ်များ

source: Titles
my: ဂုဏ်ပုဒ်များ

source: Customers
my: သုံးစွဲသူများ

source: Meterboxes
my: မီတာပုံးများ

source: Providers
my: ငွေကြေးဝန်ဆောင်မှုပေးသူများ

source: Retailers
my: ကိုယ်စားလှယ်များ

source: Bills
my: မီတာဘီလ်များ

source: Bill Details
my: ရှင်းတမ်းအသေးစိတ်

source: Payment Info - Card
my: ငွေပေးချေမှုအချက်အလက် - ကဒ်

source: Payment
my: ပေးချေမှု

source: Payment Info - Generic
my: ငွေပေးချေမှုအချက်အလက် - အထွေထွေ

source: Payment Methods
my: ပေးချေမှုနည်းလမ်းများ

source: Payment Settings
my: ငွေးပေးချေမှုဆိုင်ရာ အပြင်အဆင်များ

source: Bill Status
my: မီတာခ ဆောင်ထားခြင်း

source: Check
my: စစ်ဆေးရန်

source: Page not found
my: စာမျက်နှာကို မတွေ့ပါ

source: Search
my: ရှာဖွေပါ

source: Check Bill Status
my: မီတာခဆောင်ထားမှု စစ်ဆေးရန်
